corvette-v2/case/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| C5 Corvette case: carve the car out of the background mesh                  |
| Background 0.5 m -> level 4 = 31 mm, level 5 = 16 mm, level 6 = 8 mm        |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    corvette.stl
    {
        type triSurfaceMesh;
        name corvette;
    }

    nearCar
    {
        type searchableBox;
        min (-0.5 -1.3 0.0);
        max (7.5 1.3 1.6);
    }

    // Invisible box around the car and its near wake, refined to level 4
    refinementBox
    {
        type searchableBox;
        min (-1.0 -1.5 0.0);
        max (10.0  1.5 2.0);
    }
}

castellatedMeshControls
{
    maxLocalCells       2000000;
    maxGlobalCells      20000000;   // raised from the tutorial's 2 million
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    features
    (
        {
            file  "corvette.eMesh";
            level 6;
        }
    );

    refinementSurfaces
    {
        corvette
        {
            // cells touching the car: 16 mm, down to 8 mm where it curves
            level (5 6);
            patchInfo
            {
                type     wall;
                inGroups (corvetteGroup);
            }

            // The STL has 5 regions (body + 4 wheels, see tools/split_wheels.py).
            // Each becomes its own patch, e.g. corvette_wheel_FL, so the wheels
            // can rotate. They stay in corvetteGroup so the force totals still
            // include them, and wheelGroup lets you measure wheel forces alone.
            regions
            {
                wheel_FL { level (5 6); patchInfo { type wall; inGroups (corvetteGroup wheelGroup); } }
                wheel_FR { level (5 6); patchInfo { type wall; inGroups (corvetteGroup wheelGroup); } }
                wheel_RL { level (5 6); patchInfo { type wall; inGroups (corvetteGroup wheelGroup); } }
                wheel_RR { level (5 6); patchInfo { type wall; inGroups (corvetteGroup wheelGroup); } }
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        refinementBox
        {
            mode   inside;
            levels ((1E15 4));
        }
        nearCar
        {
            mode   inside;
            levels ((1E15 5));
        }
    }

    // Must be in the air: inside the tunnel, well away from the car
    locationInMesh (20.0001 4.0001 5.0001);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch            3;
    tolerance               2.0;
    nSolveIter              30;
    nRelaxIter              5;
    nFeatureSnapIter        10;
    implicitFeatureSnap     false;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  false;
}

addLayersControls
{
    relativeSizes true;

    layers
    {
        "(lowerWall|corvette).*"
        {
            nSurfaceLayers 3;
        }
    }

    expansionRatio              1.2;
    finalLayerThickness         0.3;
    minThickness                0.1;
    nGrow                       0;
    featureAngle                60;
    slipFeatureAngle            30;
    nRelaxIter                  3;
    nSmoothSurfaceNormals       1;
    nSmoothNormals              3;
    nSmoothThickness            10;
    maxFaceThicknessRatio       0.5;
    maxThicknessToMedialRatio   0.3;
    minMedialAxisAngle          90;
    nBufferCellsNoExtrude       0;
    nLayerIter                  50;
}

meshQualityControls
{
    #include "meshQualityDict"
    nSmoothScale    4;
    errorReduction  0.75;
}

debug           0;
mergeTolerance  1e-6;

// ************************************************************************* //
